app/controllers/gulucas_controller.rb

SELECT "gulucas".* FROM "gulucas"
---
  def index
    @gulucas = Guluca.all

INSERT INTO "gulucas" ("correo", "created_at", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["correo", ""], ["created_at", "2014-09-07 18:30:50.475584"], ["nombre", ""], ["updated_at", "2014-09-07 18:30:50.475584"]]
---
  def create
    @guluca = Guluca.new(guluca_params)

    respond_to do |format|
      if @guluca.save

DELETE FROM "gulucas" WHERE "gulucas"."id" = ?  [["id", 1]]
---
  def destroy
    @guluca.destroy

SELECT  "gulucas".* FROM "gulucas"  WHERE "gulucas"."id" = ? LIMIT 1  [["id", 29]]
---
    def set_guluca
      @guluca = Guluca.find(params[:id])